app/controllers/calendars_controller.rb

  def create
    @calendar = Calendar.create calendar_params
---
INSERT INTO "calendars" ("name", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "adam"], ["title", "kelsey"], ["created_at", "2015-01-29 18:47:03.590955"], ["updated_at", "2015-01-29 18:47:03.590955"]]

  def show
    @calendar = Calendar.find params[:id]
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 9]]

  def edit
    @calendars = Calendar.all
    @calendar = Calendar.find params[:id]
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @calendar = Calendar.find params[:id]
    @calendar.update_attributes calendar_params
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "calendars" SET "name" = ?, "title" = ?, "updated_at" = ? WHERE "calendars"."id" = ?  [["name", "Calendar 1"], ["title", "Todays list"], ["updated_at", "2015-01-29 19:18:37.954687"], ["id", 1]]

  def destroy
    @calendar = Calendar.find params[:id]
    @calendar.destroy
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 9]]
DELETE FROM "calendars" WHERE "calendars"."id" = ?  [["id", 9]]