app/controllers/home_controller.rb

SELECT "calendars".* FROM "calendars"
---
  def index
    @calendars = Calendar.all