app/controllers/tasks_controller.rb

  def index
    @calendar = Calendar.find params[:calendar_id]
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 1]]

  def new
    @calendar = Calendar.find params[:calendar_id]
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @calendar = Calendar.find params[:calendar_id]
    @task = @calendar.tasks.create task_params
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tasks" ("title", "misc", "completed", "date", "calendar_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @calendar = Calendar.find params[:calendar_id]
    @task = @calendar.tasks.find params[:id]
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."calendar_id" = ? AND "tasks"."id" = ? LIMIT 1  [["calendar_id", "1"], ["id", 1]]

  def edit
    @calendar = Calendar.find params[:calendar_id]
    @task = @calendar.tasks.find params[:id]
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."calendar_id" = ? AND "tasks"."id" = ? LIMIT 1  [["calendar_id", "1"], ["id", 1]]

  def update
    @calendar = Calendar.find params[:calendar_id]
    @task = @calendar.tasks.find params[:id]
    @task.update_attributes task_params
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."calendar_id" = ? AND "tasks"."id" = ? LIMIT 1  [["calendar_id", "1"], ["id", 1]]
UPDATE "tasks" SET "date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["date", "2015-02-12 14:00:00.000000"], ["updated_at", "2015-02-02 14:36:11.654516"], ["id", 18]]

  def destroy
    @calendar = Calendar.find params[:calendar_id]
    @task = @calendar.tasks.find params[:id]
    @task.destroy
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."calendar_id" = ? AND "tasks"."id" = ? LIMIT 1  [["calendar_id", "1"], ["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]